ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5/TARGET_MCU_NRF52832/sdk/softdevice/s132/headers/nrf_ble_gap.h
/** @brief Keys that can be exchanged during a bonding procedure. */
typedef struct {
    uint8_t enc     : 1;                        /**< Long Term Key and Master Identification. */
    uint8_t id      : 1;                        /**< Identity Resolving Key and Identity Address Information. */
    uint8_t sign    : 1;                        /**< Connection Signature Resolving Key. */
    uint8_t link    : 1;                        /**< Derive the Link Key from the LTK. */
} ble_gap_sec_kdist_t;


/**@brief GAP security parameters. */
typedef struct {
    uint8_t               bond      : 1;             /**< Perform bonding. */
    uint8_t               mitm      : 1;             /**< Enable Man In The Middle protection. */
    uint8_t               lesc      : 1;             /**< Enable LE Secure Connection pairing. */
    uint8_t               keypress  : 1;             /**< Enable generation of keypress notifications. */
    uint8_t               io_caps   : 3;             /**< IO capabilities, see @ref BLE_GAP_IO_CAPS. */
    uint8_t               oob       : 1;             /**< Out Of Band data available. */
    uint8_t               min_key_size;              /**< Minimum encryption key size in octets between 7 and 16. If 0 then not applicable in this instance. */
    uint8_t               max_key_size;              /**< Maximum encryption key size in octets between min_key_size and 16. */
    ble_gap_sec_kdist_t   kdist_own;                 /**< Key distribution bitmap: keys that the local device will distribute. */
    ble_gap_sec_kdist_t   kdist_peer;                /**< Key distribution bitmap: keys that the remote device will distribute. */
} ble_gap_sec_params_t;


/**@brief GAP Encryption Information. */
typedef struct {
    uint8_t   ltk[BLE_GAP_SEC_KEY_LEN];   /**< Long Term Key. */
    uint8_t   lesc : 1;                   /**< Key generated using LE Secure Connections. */
    uint8_t   auth : 1;                   /**< Authenticated Key. */
    uint8_t   ltk_len : 6;                /**< LTK length in octets. */
} ble_gap_enc_info_t;


/**@brief GAP Master Identification. */
typedef struct {
    uint16_t  ediv;                       /**< Encrypted Diversifier. */
    uint8_t   rand[BLE_GAP_SEC_RAND_LEN]; /**< Random Number. */
} ble_gap_master_id_t;


/**@brief GAP Signing Information. */
typedef struct {
    uint8_t   csrk[BLE_GAP_SEC_KEY_LEN];        /**< Connection Signature Resolving Key. */
} ble_gap_sign_info_t;

/**@brief GAP LE Secure Connections P-256 Public Key. */
typedef struct {
    uint8_t   pk[BLE_GAP_LESC_P256_PK_LEN];        /**< LE Secure Connections Elliptic Curve Diffie-Hellman P-256 Public Key. Stored in the standard SMP protocol format: {X,Y} both in little-endian. */
} ble_gap_lesc_p256_pk_t;

/**@brief GAP LE Secure Connections DHKey. */
typedef struct {
    uint8_t   key[BLE_GAP_LESC_DHKEY_LEN];        /**< LE Secure Connections Elliptic Curve Diffie-Hellman Key. Stored in little-endian. */
} ble_gap_lesc_dhkey_t;

/**@brief GAP LE Secure Connections OOB data. */
typedef struct {
    ble_gap_addr_t  addr;                          /**< Bluetooth address of the device. */
    uint8_t         r[BLE_GAP_SEC_KEY_LEN];        /**< Random Number. */
    uint8_t         c[BLE_GAP_SEC_KEY_LEN];        /**< Confirm Value. */
} ble_gap_lesc_oob_data_t;

/**@brief Event structure for @ref BLE_GAP_EVT_CONNECTED. */
typedef struct {
    ble_gap_addr_t        peer_addr;              /**< Bluetooth address of the peer device. */
    ble_gap_addr_t        own_addr;               /**< Bluetooth address of the local device used during connection setup. */
    uint8_t               role;                   /**< BLE role for this connection, see @ref BLE_GAP_ROLES */
    uint8_t               irk_match : 1;          /**< If 1, peer device's address resolved using an IRK. */
    uint8_t               irk_match_idx  : 7;     /**< Index in IRK list where the address was matched. */
    ble_gap_conn_params_t conn_params;            /**< GAP Connection Parameters. */
} ble_gap_evt_connected_t;


/**@brief Event structure for @ref BLE_GAP_EVT_DISCONNECTED. */
typedef struct {
    uint8_t reason;                               /**< HCI error code, see @ref BLE_HCI_STATUS_CODES. */
} ble_gap_evt_disconnected_t;


/**@brief Event structure for @ref BLE_GAP_EVT_CONN_PARAM_UPDATE. */
typedef struct {
    ble_gap_conn_params_t conn_params;            /**<  GAP Connection Parameters. */
} ble_gap_evt_conn_param_update_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SEC_PARAMS_REQUEST. */
typedef struct {
    ble_gap_sec_params_t peer_params;             /**< Initiator Security Parameters. */
} ble_gap_evt_sec_params_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SEC_INFO_REQUEST. */
typedef struct {
    ble_gap_addr_t      peer_addr;                     /**< Bluetooth address of the peer device. */
    ble_gap_master_id_t master_id;                     /**< Master Identification for LTK lookup. */
    uint8_t             enc_info  : 1;                 /**< If 1, Encryption Information required. */
    uint8_t             id_info   : 1;                 /**< If 1, Identity Information required. */
    uint8_t             sign_info : 1;                 /**< If 1, Signing Information required. */
} ble_gap_evt_sec_info_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_PASSKEY_DISPLAY. */
typedef struct {
    uint8_t passkey[BLE_GAP_PASSKEY_LEN];         /**< 6-digit passkey in ASCII ('0'-'9' digits only). */
    uint8_t match_request : 1;                    /**< If 1 requires the application to report the match using @ref sd_ble_gap_auth_key_reply
                                                     with either @ref BLE_GAP_AUTH_KEY_TYPE_NONE if there is no match or
                                                     @ref BLE_GAP_AUTH_KEY_TYPE_PASSKEY if there is a match. */
} ble_gap_evt_passkey_display_t;

/**@brief Event structure for @ref BLE_GAP_EVT_KEY_PRESSED. */
typedef struct {
    uint8_t kp_not;         /**< Keypress notification type, see @ref BLE_GAP_KP_NOT_TYPES. */
} ble_gap_evt_key_pressed_t;


/**@brief Event structure for @ref BLE_GAP_EVT_AUTH_KEY_REQUEST. */
typedef struct {
    uint8_t key_type;                             /**< See @ref BLE_GAP_AUTH_KEY_TYPES. */
} ble_gap_evt_auth_key_request_t;

/**@brief Event structure for @ref BLE_GAP_EVT_LESC_DHKEY_REQUEST. */
typedef struct {
    ble_gap_lesc_p256_pk_t *p_pk_peer;  /**< LE Secure Connections remote P-256 Public Key. This will point to the application-supplied memory
                                           inside the keyset during the call to @ref sd_ble_gap_sec_params_reply. */
    uint8_t oobd_req       : 1;         /**< LESC OOB data required. A call to @ref sd_ble_gap_lesc_oob_data_set is required to complete the procedure. */
} ble_gap_evt_lesc_dhkey_request_t;


/**@brief Security levels supported.
 * @note See Bluetooth Specification Version 4.2 Volume 3, Part C, Chapter 10, Section 10.2.1.
*/
typedef struct {
    uint8_t lv1 : 1;                              /**< If 1: Level 1 is supported. */
    uint8_t lv2 : 1;                              /**< If 1: Level 2 is supported. */
    uint8_t lv3 : 1;                              /**< If 1: Level 3 is supported. */
    uint8_t lv4 : 1;                              /**< If 1: Level 4 is supported. */
} ble_gap_sec_levels_t;


/**@brief Encryption Key. */
typedef struct {
    ble_gap_enc_info_t    enc_info;             /**< Encryption Information. */
    ble_gap_master_id_t   master_id;            /**< Master Identification. */
} ble_gap_enc_key_t;


/**@brief Identity Key. */
typedef struct {
    ble_gap_irk_t         id_info;              /**< Identity Information. */
    ble_gap_addr_t        id_addr_info;         /**< Identity Address Information. */
} ble_gap_id_key_t;


/**@brief Security Keys. */
typedef struct {
    ble_gap_enc_key_t      *p_enc_key;           /**< Encryption Key, or NULL. */
    ble_gap_id_key_t       *p_id_key;            /**< Identity Key, or NULL. */
    ble_gap_sign_info_t    *p_sign_key;          /**< Signing Key, or NULL. */
    ble_gap_lesc_p256_pk_t *p_pk;                /**< LE Secure Connections P-256 Public Key. When in debug mode the application must use the value defined
                                                    in the Core Bluetooth Specification v4.2 Vol.3, Part H, Section 2.3.5.6.1 */
} ble_gap_sec_keys_t;


/**@brief Security key set for both local and peer keys. */
typedef struct {
    ble_gap_sec_keys_t            keys_own;     /**< Keys distributed by the local device. For LE Secure Connections the encryption key will be generated locally and will always be stored if bonding. */
    ble_gap_sec_keys_t            keys_peer;    /**< Keys distributed by the remote device. For LE Secure Connections, p_enc_key must always be NULL. */
} ble_gap_sec_keyset_t;


/**@brief Event structure for @ref BLE_GAP_EVT_AUTH_STATUS. */
typedef struct {
    uint8_t               auth_status;            /**< Authentication status, see @ref BLE_GAP_SEC_STATUS. */
    uint8_t               error_src : 2;          /**< On error, source that caused the failure, see @ref BLE_GAP_SEC_STATUS_SOURCES. */
    uint8_t               bonded : 1;             /**< Procedure resulted in a bond. */
    ble_gap_sec_levels_t  sm1_levels;             /**< Levels supported in Security Mode 1. */
    ble_gap_sec_levels_t  sm2_levels;             /**< Levels supported in Security Mode 2. */
    ble_gap_sec_kdist_t   kdist_own;              /**< Bitmap stating which keys were exchanged (distributed) by the local device. If bonding with LE Secure Connections, the enc bit will be always set. */
    ble_gap_sec_kdist_t   kdist_peer;             /**< Bitmap stating which keys were exchanged (distributed) by the remote device. If bonding with LE Secure Connections, the enc bit will never be set. */
} ble_gap_evt_auth_status_t;


/**@brief Event structure for @ref BLE_GAP_EVT_CONN_SEC_UPDATE. */
typedef struct {
    ble_gap_conn_sec_t conn_sec;                  /**< Connection security level. */
} ble_gap_evt_conn_sec_update_t;


/**@brief Event structure for @ref BLE_GAP_EVT_TIMEOUT. */
typedef struct {
    uint8_t src;                                  /**< Source of timeout event, see @ref BLE_GAP_TIMEOUT_SOURCES. */
} ble_gap_evt_timeout_t;


