ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5/TARGET_MCU_NRF52832/sdk/softdevice/s132/headers/nrf_ble_gap.h
/**@brief Event structure for @ref BLE_GAP_EVT_RSSI_CHANGED. */
typedef struct {
    int8_t  rssi;                               /**< Received Signal Strength Indication in dBm. */
} ble_gap_evt_rssi_changed_t;


/**@brief Event structure for @ref BLE_GAP_EVT_ADV_REPORT. */
typedef struct {
    ble_gap_addr_t peer_addr;                     /**< Bluetooth address of the peer device. */
    int8_t         rssi;                          /**< Received Signal Strength Indication in dBm. */
    uint8_t        scan_rsp : 1;                  /**< If 1, the report corresponds to a scan response and the type field may be ignored. */
    uint8_t        type     : 2;                  /**< See @ref BLE_GAP_ADV_TYPES. Only valid if the scan_rsp field is 0. */
    uint8_t        dlen     : 5;                  /**< Advertising or scan response data length. */
    uint8_t        data[BLE_GAP_ADV_MAX_SIZE];    /**< Advertising or scan response data. */
} ble_gap_evt_adv_report_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SEC_REQUEST. */
typedef struct {
    uint8_t    bond       : 1;                       /**< Perform bonding. */
    uint8_t    mitm       : 1;                       /**< Man In The Middle protection requested. */
    uint8_t    lesc       : 1;                       /**< LE Secure Connections requested. */
    uint8_t    keypress   : 1;                       /**< Generation of keypress notifications requested. */
} ble_gap_evt_sec_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST. */
typedef struct {
    ble_gap_conn_params_t conn_params;            /**<  GAP Connection Parameters. */
} ble_gap_evt_conn_param_update_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SCAN_REQ_REPORT. */
typedef struct {
    int8_t                  rssi;              /**< Received Signal Strength Indication in dBm. */
    ble_gap_addr_t          peer_addr;         /**< Bluetooth address of the peer device. */
} ble_gap_evt_scan_req_report_t;



/**@brief GAP event structure. */
typedef struct {
    uint16_t conn_handle;                                     /**< Connection Handle on which event occurred. */
    union {                                                   /**< union alternative identified by evt_id in enclosing struct. */
        ble_gap_evt_connected_t                   connected;                    /**< Connected Event Parameters. */
        ble_gap_evt_disconnected_t                disconnected;                 /**< Disconnected Event Parameters. */
        ble_gap_evt_conn_param_update_t           conn_param_update;            /**< Connection Parameter Update Parameters. */
        ble_gap_evt_sec_params_request_t          sec_params_request;           /**< Security Parameters Request Event Parameters. */
        ble_gap_evt_sec_info_request_t            sec_info_request;             /**< Security Information Request Event Parameters. */
        ble_gap_evt_passkey_display_t             passkey_display;              /**< Passkey Display Event Parameters. */
        ble_gap_evt_key_pressed_t                 key_pressed;                  /**< Key Pressed Event Parameters. */
        ble_gap_evt_auth_key_request_t            auth_key_request;             /**< Authentication Key Request Event Parameters. */
        ble_gap_evt_lesc_dhkey_request_t          lesc_dhkey_request;           /**< LE Secure Connections DHKey calculation request. */
        ble_gap_evt_auth_status_t                 auth_status;                  /**< Authentication Status Event Parameters. */
        ble_gap_evt_conn_sec_update_t             conn_sec_update;              /**< Connection Security Update Event Parameters. */
        ble_gap_evt_timeout_t                     timeout;                      /**< Timeout Event Parameters. */
        ble_gap_evt_rssi_changed_t                rssi_changed;                 /**< RSSI Event parameters. */
        ble_gap_evt_adv_report_t                  adv_report;                   /**< Advertising Report Event Parameters. */
        ble_gap_evt_sec_request_t                 sec_request;                  /**< Security Request Event Parameters. */
        ble_gap_evt_conn_param_update_request_t   conn_param_update_request;    /**< Connection Parameter Update Parameters. */
        ble_gap_evt_scan_req_report_t             scan_req_report;              /**< Scan Request Report parameters. */
    } params;                                                                 /**< Event Parameters. */

} ble_gap_evt_t;


/**@brief Channel Map option.
 *        Used with @ref sd_ble_opt_get to get the current channel map
 *        or @ref sd_ble_opt_set to set a new channel map. When setting the
 *        channel map, it applies to all current and future connections. When getting the
 *        current channel map, it applies to a single connection and the connection handle
 *        must be supplied.
 *
 * @note  Setting the channel map may take some time, depending on connection parameters.
 *        The time taken may be different for each connection and the get operation will
 *        return the previous channel map until the new one has taken effect.
 *
 * @note  After setting the channel map, by spec it can not be set again until at least 1 s has passed.
 *        See Bluetooth Specification Version 4.1 Volume 2, Part E, Section 7.3.46.
 *
 * @retval ::NRF_SUCCESS Get or set successful.
 * @retval ::NRF_ERROR_BUSY Channel map was set again before enough time had passed.
 * @retval ::NRF_ERROR_INVALID_STATE Invalid state to perform operation.
 * @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied for get.
 * @retval ::NRF_ERROR_NOT_SUPPORTED Returned by sd_ble_opt_set in peripheral-only SoftDevices.
 *
 */
typedef struct {
    uint16_t conn_handle;                   /**< Connection Handle (only applicable for get) */
    uint8_t ch_map[5];                      /**< Channel Map (37-bit). */
} ble_gap_opt_ch_map_t;


